In [1]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import confusion_matrix
from sklearn.neighbors import KNeighborsClassifier

from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
database_path = "/content/drive/My Drive/DBs/KNN/"

In [3]:
database = pd.read_csv(database_path + "Social_Network_Ads.csv")

In [4]:
database.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
dummy_db = pd.get_dummies(database['Gender'])
dummy_db.head()

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1

In [6]:
database = pd.concat([dummy_db, database.drop(['User ID','Gender'], axis =1 )], axis = 1)
database.head()

   Female  Male  Age  EstimatedSalary  Purchased
0       0     1   19            19000          0
1       0     1   35            20000          0
2       1     0   26            43000          0
3       1     0   27            57000          0
4       0     1   19            76000          0

In [7]:
X = database.drop(['Purchased'], axis = 1)
y = database['Purchased']

In [8]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 2)

In [9]:
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [10]:
classifier = KNeighborsClassifier(n_neighbors=5, metric='minkowski', p=2)

In [11]:
classifier.fit(X_train, y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

In [12]:
y_pred = classifier.predict(X_test)

In [13]:
classifier.score(X_test, y_test)

0.9375